// © Copyright 2004-2007, 2015 HP Development Company, L.P.

TaskName = "Upload Fonts";

OkButtonTitle = "OK";
CancelButtonTitle = "Cancel";
LoadingStorageDeviceInfoProcessTitle = "Loading storage device info…";
LoadingStorageDeviceListProcessTitle = "Loading list of storage devices…";
LoadingFontListProcessTitle = "Loading list of fonts…";
SendingFontProcessTitle = "Uploading font \"%@\"…";
RemovingFontProcessTitle = "Removing font \"%@\"…";
RemoveConfirmationMessage = "Are you sure you want to remove the selected fonts from the printer?";
RemoveConfirmationMessageExplanation = "You cannot undo this action.";
RemoveFromMemoryMessage = "Fonts can not be deleted from the device memory";
RemoveFromMemoryExplanation = "All the pre-installed fonts are read-only. All fonts added by user will be deleted from the memory when the device is restarted. Fonts on other storage devices are saved during reboot and can be removed manually.";

StorageDeviceLocked = "Storage device is locked";

DiskNameTemplate = "Disk, ID=%@ (Size: %@)";
FlashNameTemplate = "Flash SIMM, ID=%@ (Size: %@)";
SizeInBytes = "%.1f bytes";
SizeInKBytes = "%.1f KB";
SizeInMBytes = "%.1f MB";
SizeInGBytes = "%.1f GB";
SizeInTBytes = "%.1f TB";

// Errors
FileOpenError = "Cannot open the \"%@\" font file.";
FileOpenErrorExplanation = "This file is either corrupted or it may have unsupported format. Please select other font file and try again.";
FormatError = "The \"%@\" font is not of a recognized format.";
FormatErrorExplanation = "Please select other font file and try again.";
SingleUnsupportedError = "The font \"%@\" is not supported.";
SingleUnsupportedErrorExplanation = "The font will be skipped.";
MultipleUnsupportedError = "The fonts %@ are not supported.";
MultipleUnsupportedErrorExplanation = "The fonts will be skipped.";
SingleAlreadyScheduledError = "The font \"%@\" is already in the list.";
SingleAlreadyScheduledErrorExplanation = "The font will be skipped.";
MultipleAlreadyScheduledError = "The fonts %@ are already in the list.";
MultipleAlreadyScheduledErrorExplanation = "The fonts will be skipped.";
SingleAlreadyUploadedError = "The font \"%@\" already exists on the printer.";
SingleAlreadyUploadedErrorExplanation = "The font will be skipped.";
MultipleAlreadyUploadedError = "The fonts %@ already exist on the printer.";
MultipleAlreadyUploadedErrorExplanation = "The fonts will be skipped.";
PrintChannelOpenError = "Cannot open a printer channel.";
PrintChannelOpenErrorExplanation = "Please check that your printer is connected and turned on, then try again.";
DataSendError = "Cannot send data to the printer.";
DataSendErrorExplanation = "Please check that your printer is connected and turned on, then try again.";
DataReceiveError = "Cannot receive data from the printer.";
DataReceiveErrorExplanation = "Please check that your printer is connected and turned on, then try again.";
FontSendError = "Cannot send \"%@\" font data to the printer.";
FontSendErrorExplanation = "Please check that your printer is connected and turned on. Note the rest of the font list have not been sent to the printer.";
FontRemoveError = "Cannot remove \"%@\" font from the printer.";
FontRemoveErrorExplanation = "Please check that your printer is connected and turned on. Note the rest of the font list have not been removed from the printer.";
StorageDeviceFullError = "The \"%@\" font could not be uploaded because the storage device is full.";
StorageDeviceFullErrorExplanation = "Please select other storage device or remove some unused fonts, then try again. Note the rest of the font list have not been uploaded to the printer.";
ScriptProcessingError = "The script with \"%@\" font could not processed.";
ScriptProcessingErrorExplanation = "Please select other font and try again. Note the rest of the font list have not been uploaded to the printer.";
DeviceVmError = "The \"%@\" font could not be uploaded because the printer is low on memory.";
DeviceVmErrorExplanation = "Please select other storage device or remove some unused fonts, then try again. Note the rest of the font list have not been uploaded to the printer.";

DeviceBusyErrorTitle = "Device is currently busy.";
DeviceBusyErrorMessage = "Please wait while the device finishes its current job.";

FontNameTemplate = "\"%@\"";

Memory = "Memory";
UpdateNeeded = "Update needed";

TaskTitle = "Upload Fonts";
TaskDescription = "Select a file containing printer fonts and transfer that file to your printer. The fonts you transfer will then be available for use in print jobs.";
StorageDevices = "Fonts in printer's:";
UpdateButton = "Update Fonts List";
RemoveButton = "Remove";
AddButton = "Add…";
